; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v6 ?v11)
             (pred_5 ?v13 ?v7)
             (pred_7 ?v6 ?v7)
             (pred_3 ?v1 ?v6 )
	     (pred_9 ?v6)
             (pred_12 ?v12)
             (pred_4 ?v13)
             (pred_10 ?v7)
             (pred_2 ?v6)
             (pred_6 ?v13)
             (pred_1 ?v6)
             (pred_11 ))



(:action op_3
:parameters (?v5 ?v8 ?v9 ?v10)
:precondition (and (pred_12 ?v5) (pred_12 ?v8) (pred_4 ?v9) (pred_10 ?v10)
          (pred_8 ?v5 ?v8) (pred_5 ?v9 ?v10)
                   (pred_7 ?v8 ?v10) (pred_9 ?v5) 
                   (pred_2 ?v8) (pred_6 ?v9))
:effect (and  (pred_1 ?v8) (not (pred_2 ?v8))))


(:action op_1
:parameters (?v5 ?v2)
:precondition (and (pred_12 ?v5) (pred_12 ?v2)
               (pred_9 ?v5) (pred_8 ?v5 ?v2) (pred_1 ?v2))
:effect (and (pred_9 ?v2) (not (pred_9 ?v5))))

(:action op_2
:parameters (?v5 ?v9)
:precondition (and (pred_12 ?v5) (pred_4 ?v9) 
                  (pred_9 ?v5) (pred_3 ?v9 ?v5) (pred_11 ))
:effect (and (pred_6 ?v9)
   (not (pred_3 ?v9 ?v5)) (not (pred_11 ))))


(:action op_5
:parameters (?v5 ?v4 ?v3)
:precondition (and (pred_12 ?v5) (pred_4 ?v4) (pred_4 ?v3)
                  (pred_9 ?v5) (pred_6 ?v3) (pred_3 ?v4 ?v5))
:effect (and (pred_6 ?v4) (pred_3 ?v3 ?v5)
        (not (pred_6 ?v3)) (not (pred_3 ?v4 ?v5))))

(:action op_4
:parameters (?v5 ?v9)
:precondition (and (pred_12 ?v5) (pred_4 ?v9) 
                  (pred_9 ?v5) (pred_6 ?v9))
:effect (and (pred_11 ) (pred_3 ?v9 ?v5) (not (pred_6 ?v9)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_05 obj_16 obj_20 obj_27 obj_23 obj_26 obj_31 obj_14 obj_03 obj_04 obj_19 obj_06 obj_12 obj_11 obj_09 obj_21 obj_25 obj_29 obj_07 obj_15 obj_24 obj_01 obj_10 obj_18 obj_08
    obj_28 obj_13 obj_17
    obj_30 obj_22 obj_02
    )

    (:init
       (pred_11)

       (pred_12 obj_05)
       (pred_12 obj_16)
       (pred_12 obj_20)
       (pred_12 obj_27)
       (pred_12 obj_23)
       (pred_12 obj_26)
       (pred_12 obj_31)
       (pred_12 obj_14)
       (pred_12 obj_03)
       (pred_12 obj_04)
       (pred_12 obj_19)
       (pred_12 obj_06)
       (pred_12 obj_12)
       (pred_12 obj_11)
       (pred_12 obj_09)
       (pred_12 obj_21)
       (pred_12 obj_25)
       (pred_12 obj_29)
       (pred_12 obj_07)
       (pred_12 obj_15)
       (pred_12 obj_24)
       (pred_12 obj_01)
       (pred_12 obj_10)
       (pred_12 obj_18)
       (pred_12 obj_08)
       (pred_10 obj_28)
       (pred_10 obj_13)
       (pred_10 obj_17)
       (pred_4 obj_30)
       (pred_4 obj_22)
       (pred_4 obj_02)

       (pred_8 obj_05 obj_26)
       (pred_8 obj_05 obj_16)
       (pred_8 obj_16 obj_31)
       (pred_8 obj_16 obj_20)
       (pred_8 obj_16 obj_05)
       (pred_8 obj_20 obj_14)
       (pred_8 obj_20 obj_27)
       (pred_8 obj_20 obj_16)
       (pred_8 obj_27 obj_03)
       (pred_8 obj_27 obj_23)
       (pred_8 obj_27 obj_20)
       (pred_8 obj_23 obj_04)
       (pred_8 obj_23 obj_27)
       (pred_8 obj_26 obj_19)
       (pred_8 obj_26 obj_31)
       (pred_8 obj_26 obj_05)
       (pred_8 obj_31 obj_06)
       (pred_8 obj_31 obj_14)
       (pred_8 obj_31 obj_16)
       (pred_8 obj_31 obj_26)
       (pred_8 obj_14 obj_12)
       (pred_8 obj_14 obj_03)
       (pred_8 obj_14 obj_20)
       (pred_8 obj_14 obj_31)
       (pred_8 obj_03 obj_11)
       (pred_8 obj_03 obj_04)
       (pred_8 obj_03 obj_27)
       (pred_8 obj_03 obj_14)
       (pred_8 obj_04 obj_09)
       (pred_8 obj_04 obj_23)
       (pred_8 obj_04 obj_03)
       (pred_8 obj_19 obj_21)
       (pred_8 obj_19 obj_06)
       (pred_8 obj_19 obj_26)
       (pred_8 obj_06 obj_25)
       (pred_8 obj_06 obj_12)
       (pred_8 obj_06 obj_31)
       (pred_8 obj_06 obj_19)
       (pred_8 obj_12 obj_29)
       (pred_8 obj_12 obj_11)
       (pred_8 obj_12 obj_14)
       (pred_8 obj_12 obj_06)
       (pred_8 obj_11 obj_07)
       (pred_8 obj_11 obj_09)
       (pred_8 obj_11 obj_03)
       (pred_8 obj_11 obj_12)
       (pred_8 obj_09 obj_15)
       (pred_8 obj_09 obj_04)
       (pred_8 obj_09 obj_11)
       (pred_8 obj_21 obj_24)
       (pred_8 obj_21 obj_25)
       (pred_8 obj_21 obj_19)
       (pred_8 obj_25 obj_01)
       (pred_8 obj_25 obj_29)
       (pred_8 obj_25 obj_06)
       (pred_8 obj_25 obj_21)
       (pred_8 obj_29 obj_10)
       (pred_8 obj_29 obj_07)
       (pred_8 obj_29 obj_12)
       (pred_8 obj_29 obj_25)
       (pred_8 obj_07 obj_18)
       (pred_8 obj_07 obj_15)
       (pred_8 obj_07 obj_11)
       (pred_8 obj_07 obj_29)
       (pred_8 obj_15 obj_08)
       (pred_8 obj_15 obj_09)
       (pred_8 obj_15 obj_07)
       (pred_8 obj_24 obj_01)
       (pred_8 obj_24 obj_21)
       (pred_8 obj_01 obj_10)
       (pred_8 obj_01 obj_25)
       (pred_8 obj_01 obj_24)
       (pred_8 obj_10 obj_18)
       (pred_8 obj_10 obj_29)
       (pred_8 obj_10 obj_01)
       (pred_8 obj_18 obj_08)
       (pred_8 obj_18 obj_07)
       (pred_8 obj_18 obj_10)
       (pred_8 obj_08 obj_15)
       (pred_8 obj_08 obj_18)
       (pred_2 obj_03)
       (pred_2 obj_08)
       (pred_2 obj_31)
       (pred_7  obj_03 obj_28)
       (pred_7  obj_08 obj_13)
       (pred_7  obj_31 obj_17)
       (pred_1 obj_05)
       (pred_1 obj_16)
       (pred_1 obj_20)
       (pred_1 obj_27)
       (pred_1 obj_23)
       (pred_1 obj_26)
       (pred_1 obj_14)
       (pred_1 obj_04)
       (pred_1 obj_19)
       (pred_1 obj_06)
       (pred_1 obj_12)
       (pred_1 obj_11)
       (pred_1 obj_09)
       (pred_1 obj_21)
       (pred_1 obj_25)
       (pred_1 obj_29)
       (pred_1 obj_07)
       (pred_1 obj_15)
       (pred_1 obj_24)
       (pred_1 obj_01)
       (pred_1 obj_10)
       (pred_1 obj_18)

       (pred_5  obj_30 obj_28)
       (pred_5  obj_22 obj_13)
       (pred_5  obj_02 obj_17)
       (pred_3 obj_30 obj_23)
       (pred_3 obj_22 obj_05)
       (pred_3 obj_02 obj_26)
       (pred_9 obj_27)
    )

    (:goal (and
       (pred_3 obj_30 obj_12)
       (pred_3 obj_22 obj_26)
    ))
(:constraints
  (always (not (pred_9 obj_20)))
)
)

; plan
1. (op_1 obj_27 obj_23)
   deleted: (pred_9 obj_27)
   added: (pred_9 obj_23)
   goals met: 0 of 2
2. (op_2 obj_23 obj_30)
   deleted: (pred_3 obj_30 obj_23) (pred_11)
   added: (pred_6 obj_30)
   goals met: 0 of 2
3. (op_1 obj_23 obj_27)
   deleted: (pred_9 obj_23)
   added: (pred_9 obj_27)
   goals met: 0 of 2
4. (op_3 obj_27 obj_03 obj_30 obj_28)
   deleted: (pred_2 obj_03)
   added: (pred_1 obj_03)
   goals met: 0 of 2
5. (op_1 obj_27 obj_03)
   deleted: (pred_9 obj_27)
   added: (pred_9 obj_03)
   goals met: 0 of 2
6. (op_1 obj_03 obj_14)
   deleted: (pred_9 obj_03)
   added: (pred_9 obj_14)
   goals met: 0 of 2
7. (op_1 obj_14 obj_12)
   deleted: (pred_9 obj_14)
   added: (pred_9 obj_12)
   goals met: 0 of 2
8. (op_1 obj_12 obj_06)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_06)
   goals met: 0 of 2
9. (op_1 obj_06 obj_19)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_19)
   goals met: 0 of 2
10. (op_1 obj_19 obj_26)
   deleted: (pred_9 obj_19)
   added: (pred_9 obj_26)
   goals met: 0 of 2
11. (op_1 obj_26 obj_05)
   deleted: (pred_9 obj_26)
   added: (pred_9 obj_05)
   goals met: 0 of 2
12. (op_5 obj_05 obj_22 obj_30)
   deleted: (pred_6 obj_30) (pred_3 obj_22 obj_05)
   added: (pred_6 obj_22) (pred_3 obj_30 obj_05)
   goals met: 0 of 2
13. (op_1 obj_05 obj_26)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_26)
   goals met: 0 of 2
14. (op_5 obj_26 obj_02 obj_22)
   deleted: (pred_6 obj_22) (pred_3 obj_02 obj_26)
   added: (pred_6 obj_02) (pred_3 obj_22 obj_26)
   goals met: 1 of 2
15. (op_1 obj_26 obj_05)
   deleted: (pred_9 obj_26)
   added: (pred_9 obj_05)
   goals met: 1 of 2
16. (op_5 obj_05 obj_30 obj_02)
   deleted: (pred_6 obj_02) (pred_3 obj_30 obj_05)
   added: (pred_6 obj_30) (pred_3 obj_02 obj_05)
   goals met: 1 of 2
17. (op_1 obj_05 obj_26)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_26)
   goals met: 1 of 2
18. (op_1 obj_26 obj_19)
   deleted: (pred_9 obj_26)
   added: (pred_9 obj_19)
   goals met: 1 of 2
19. (op_1 obj_19 obj_06)
   deleted: (pred_9 obj_19)
   added: (pred_9 obj_06)
   goals met: 1 of 2
20. (op_1 obj_06 obj_12)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_12)
   goals met: 1 of 2
21. (op_4 obj_12 obj_30)
   deleted: (pred_6 obj_30)
   added: (pred_11) (pred_3 obj_30 obj_12)
   goals met: 2 of 2
